{"id": 0, "inputs_pretokenized": "‘Well, this is weird, isn’t it?” says Damon Albarn. Six days ago, he was in Mexico City, playing with Gorillaz. Now, he and his bandmates in the Good, the Bad & the Queen are in Kent, taking turns to explain their second album in a fake American diner adjacent to the Maidstone studio where they will be performing on Later … with Jools Holland.\n\nThe seats are regulation red leatherette, and there are pictures on the wall of Stevie Wonder circa 1980’s Hotter Than July, a Ford truck and a Route 66 sign. And under glaring lights, as he picks at a vegetarian dinner in a polystyrene box, Albarn is talking about things that feel as if they have no place here at all: English folk myths; the north of England’s coastal resorts; his family’s background in Lincolnshire, Nottinghamshire and Yorkshire – and, more than anything, Brexit. Harking back almost 25 years, he describes the new album as “the next instalment of Parklife. Like Parklife is a world, this is another world. Not entirely the real world, but not entirely far off it.”\n\nMerrie Land comes nearly 12 years after its predecessor. Like that record, this one was created by Albarn, former Clash bassist Paul Simonon, the trailblazing Nigerian drummer Tony Allen and guitarist/keyboard player Simon Tong (late of the Verve). After that, the similarities end. As if to illustrate the kind of openness and diversity that Albarn thinks Brexit might imperil, the new album has a broader musical palette. Not for nothing has Simonon described Merrie Land as a work of “modern English folk music with a bit of rub-a-dub in it”.\n\n“This time around, people can dance,” says Allen, a youthful 78, with the easy confidence that comes from having made breathtakingly original music since the 1960s. “Even without getting up, they can still have their body moving to the music. Everything is in there. With the first record, people asked me: ‘Tony Allen – what the fuck are you doing on this album? We don’t hear you.’ This time around, nobody’s going to ask me that. They can hear me on every track.”\n\nBrexit is wrong. Jacob Rees-Mogg and people in Blackpool should never be together\n\nThe biggest shift, though, is in the album’s theme. The first record portrayed the murky, bohemian parts of Albarn and Simonon’s west London home turf. To evoke the contorted confusion of Brexit, Merrie Land widens its focus beyond the capital and has an even sharper sense of place. There are moments when Albarn suspends his usual fondness for dealing in mood and texture, rather than lyrical specifics, and clearly speaks his mind.\n\nThe title track is a perfect example, featuring more pointedly political lyrics than Albarn has ever previously written. One of its most plainspoken passages questions the strange alliance between a swathe of working-class Brexit voters and the privately educated opportunists who style themselves as their leaders: “You were the ones who work together / Put the money in the pockets / Of the few and their fortunes / Who crowd the school benches / And jeer at us all because they don’t care about us / They are graceless and you shouldn’t be with them.”\n\nWatch the video for Merrie Land\n\nHe doesn’t understand why so many people apparently are with “them”. “That’s what I’m really upset about,” he says. “But because my family come from the north, and I grew up in Essex in the 80s, I can feel a great affinity with [Brexit voters] as well.\n\n“But this” – he means Brexit – “is wrong. Jacob Rees-Mogg and people in Blackpool should never be together. Unless Jacob Rees-Mogg is prepared to go to Blackpool on a Saturday night and have a fucking great time.”\n\nThe referendum result arrived a few hours before Albarn and the Orchestra of Syrian Musicians were set to perform at Glastonbury 2016. “We had this great performance ready and none of the Syrians could really understand why a lot of us were so upset and shocked,” he says. “If I’d had any idea that we were going to act as a people in the way that we have – prior and post – I would definitely have come back a lot earlier, if you know what I mean. As a person who loves their country, I would have expressed a very strong opinion. In public.”\n\nDoes he regret not having done that? “Well, I had no idea. I don’t know if I should tell you this. It’s too political …” He mentions Ian Birrell, the journalist who briefly worked as David Cameron’s speechwriter. He and Albarn co-founded Africa Express, an organisation that aims to break down cultural barriers by bringing together musicians from different countries. “He texted Cameron on Thursday [the day of the vote], just at the airport before we were flying to Bristol, to say: ‘What do you think is going to happen?’ And the text came back: ‘It’s going to be fine.’\n\n“So I would imagine there were quite a few people who were surprised. It was very strange. Strange times. And from that point onwards, I’ve been thinking about how to express how I feel about it all.”\n\nI wanted to begin to understand how this abyss had opened up in the centre of our culture\n\nSome of Merrie Land’s key songs began to cohere in Blackpool, where 67.5% of voters backed Brexit. “The day after the referendum, I realised I was … guilty, in the sense of having looked in different directions,” Albarn explains. “I’ve played the big towns in England, which is what you get drawn into. But I wanted to begin to understand how this abyss had opened up in the centre of our culture. And Blackpool, maybe from the time I’d been there with Blur, just fascinated me. It was partly about memory: those pictures of everyone dressed beautifully, hanging out on the sand. And the modern Blackpool. The hedonism. The families who look after the piers and are still trying to make a go of it. The tower, which is sturdy and magnificent. You also get into the anti-fracking campaign in the countryside not that far away. It’s just a whole musical terrain.”\n\nAlbarn, Simonon and Tong spent a week there working on new material in January 2017. The album was going to focus on Blackpool, but its scope widened when Albarn began an on-off odyssey around the country, fitted in between two years of touring with Gorillaz. “I was observing,” he says. “Watching, listening. Just taking it all in, like a fine wine,” he laughs. “I went to St Albans. I went to Banbury, Oxford and Luton. Liverpool, Southend. I just walked around – had a cup of tea somewhere, or went to a pub. I wasn’t interviewing people: I was on these quiet, meditative pilgrimages to towns I’d never been to, to learn more about where I came from.”\n\nThe music they wrote suggests no end of ghosts: off-key pub pianos, bass recorders, an abundance of old-school organ that instantly evokes the British seaside. A song called Lady Boston has the most vivid sense of place, pushing the record out of England and into Wales. It was inspired by Albarn’s visit to Penrhyn castle, near Bangor, a Victorian stately home built using the inherited proceeds from slavery in Jamaica. The band returned there to record the finished song, which has a Welsh-language refrain sung by the Penrhyn male voice choir: “Dwi wrth dy gefn”, which roughly translates as, “I’ve got your back.”\n\n“It has a sense of, ‘We rely on each other’,” says Albarn. “We live on this stroppy little island, and we need to talk to each other. But have we not just spent the last couple of years going round in circles? As Danny Dyer said, it’s a mad riddle. Or you could say it’s an Anglo-Saxistentialist crisis.”\n\nWhat does he mean? “I was looking through stuff not that long ago, and I found a front page of the Sun from the Britpop era. I’d written on a bit of it in Biro when I was doing Parklife: ‘Anglo-Saxistentalism’. I thought: ‘That’s weird – that’s what I’m talking about now.’ In the most crass form, we say we want our country back. But you need to know what your country is before you want it back. And part of that is understanding who we are. We’re Vikings. We’re Anglo-Saxons. We’re French, Belgian, Nigerian, Caribbean, Ghanian, Somalian, Pakistani. To say, ‘We’re just this’ seems ridiculous to me. That’s all. That’s my biggest problem with [Brexit]: don’t limit yourself, guys. I don’t think we can afford to have that attitude. We need to be very outward-looking.”\n\nHe returns to Blackpool, or somewhere like it. “That’s why we have all those piers. That’s a kind of metaphor for trying to reach out into the world.”\n\nThe Good, the Bad & the Queen in London, 2018. Photograph: David Levene/Guardian\n\nFor Simonon, Brexit fits awkwardly with his family background, which lies variously in the Belgian city of Liège, Nice and Whitby – and lots of the popular instincts that fed into the referendum result sit at odds with the band with which he cut his teeth. In the Clash documentary Westway to the"}
{"id": 1, "inputs_pretokenized": "1. Introduction {#s0005}\n===============\n\nTarlov cysts are perineural fluid-filled sacs that are usually found in the lumbosacral spine around the junction of peripheral nerve roots and the respective dorsal root ganglia. The cysts are extradural meningeal cysts with collections of cerebrospinal fluid (CSF) within the nerve root sheath \\[[@bb0005]\\]. Tarlov cysts are found in roughly 1%--5% of the general population. \\[[@bb0010],[@bb0015]\\]. Interestingly, some studies have demonstrated that women account for 59%--70% of cases \\[[@bb0010],[@bb0020]\\]. Symptomatic Tarlov cysts are rare but can sometimes grow in size and compress adjacent nerve root structures, leading to localized or radicular pain, bowel and bladder symptoms, or other neurological sequelae. The most common presenting symptoms are back pain, pelvic pain, perineal pain, lumbar radiculopathy, or bowel/bladder symptoms. These are generally exacerbated by maneuvers that raise the CSF pressure such as standing, coughing, sneezing, or straining to void or defecate. Diagnosis is generally done with imaging and magnetic resonance imaging (MRI) is the modality of choice.\n\nTarlov cysts were first described by Tarlov in 1938 as an incidental finding during an autopsy \\[[@bb0025]\\]. Since then a variety of surgical and non-surgical interventions have been described for the treatment of Tarlov cysts. Unfortunately, there is a high rate of complications associated with surgical treatment of these cysts including hemorrhage, neurological deficit, CSF leak, infection, chronic pain, and cyst recurrence. A systematic review of surgical and non-surgical management of Tarlov cysts demonstrated a 21% and 12.47% complication rate respectively. There was a higher rate of transient sciatica, CSF-related complications, and bladder/bowel complications. Interestingly, both groups reported symptomatic improvement in 83.5% of patients. Transient exacerbation of symptoms and cyst recurrence was noted to be higher in non-surgically managed groups, suggesting surgical management is associated with higher postprocedural complication rates but better long-term efficacy for symptoms and cyst resolution \\[[@bb0030]\\]. Given the rarity of the condition and the high complication rates associated with surgical management, there is currently no consensus regarding the best treatment for patients who are symptomatic.\n\nWe describe a patient who had a longstanding history of chronic pelvic pain secondary to multiple sacral Tarlov cysts. She underwent surgery for her condition, but it worsened her symptoms and the patient ultimately obtained relief with the use of a high-frequency spinal cord stimulator (SCS).\n\n2. Case Description {#s0010}\n===================\n\nThe patient was a 66-year-old woman with a longstanding history of chronic pelvic pain secondary to multiple large Tarlov cysts affecting the S1-S4 nerve roots. She had attempted medication management with acetaminophen, NSAIDs, and neuropathic pain medications. She had also undergone a series of epidural steroid injections and a trial of superior hypogastric plexus blocks but obtain minimal relief with these. She ultimately had surgery for the removal of the Tarlov cysts as well as sacral lamina reconstruction ([Fig. 1](#f0005){ref-type=\"fig\"}). However, the patient\\'s surgery resulted in worsening of her chronic pelvic pain, and also produced new-onset back pain and lumbar radiculopathy down both legs. The patient reported constant debilitating back and pelvic pain with intermittent stabbing and burning pain in her legs. Her worsening symptoms were uncontrolled with continued medication management as well as a repeat series of epidural steroid injections.Fig. 1Lumbosacral MRI demonstrating post-surgical changes after the patient\\'s initial surgery.Fig. 1\n\nGiven that the patient\\'s worsening symptoms were unrelieved with both medication management and interventional pain procedures, we tried high-frequency spinal cord stimulation for her worsening pain and new-onset radiculopathy. The patient was counseled regarding the risks and benefits of the procedure and elected to proceed. A spinal cord stimulator lead was introduced into the epidural space and advanced to the superior endplate of T8. A second lead was placed at the superior endplate of T9 ([Fig. 2](#f0010){ref-type=\"fig\"}).Fig. 2Fluoroscopic imaging demonstrating SCS lead placement in the posterior epidural space at the superior levels of T8 and T9.Fig. 2\n\nThe patient presented for follow-up after the procedure and reported significant improvement in her symptoms. She noted that the use of SCS had resulted in a 90% improvement of her back pain, a 95% improvement in her pelvic pain, and \\>50% improvement in her radiculopathy. Additionally, she reported she was much more active and was able to decrease her medication use with the pain relief she obtained from spinal cord stimulation.\n\n3. Discussion {#s0015}\n=============\n\nTarlov cysts can be a challenging condition to recognize and diagnose given the rarity of the condition. Although these cysts most commonly affect the sacral nerve roots, they have been found in lumbar, thoracic, and cervical regions as well. The condition is generally asymptomatic. However, a small percentage of patients may demonstrate symptoms related to nerve root compression. Tarlov cysts tend to expand over time and can cause nerve root irritation, leading to pain or other neurological disturbances.\n\nThere is no consensus on the optimal management of symptomatic Tarlov cysts. Percutaneous cyst drainage is a nonsurgical intervention has been used to treat this condition \\[[@bb0015]\\]. This treatment is only temporary though, as cysts tend to gradually reform and symptoms recur. In addition to percutaneous drainage, one study has demonstrated that cyst aspiration with the placement of fibrin glue can prevent recurrence of the cysts. However, these patients are also at significant risk for postprocedural aseptic meningitis \\[[@bb0035]\\].\n\nSurgical treatment of symptomatic cysts varies and can involve complete cyst removal with excision of the affected posterior root and ganglion, decompressive laminectomy, cyst wall resection, and cyst fenestration \\[[@bb0040], [@bb0045], [@bb0050], [@bb0055]\\]. The success and complication rates vary greatly by procedure. Again, there is no consensus regarding when surgical management for Tarlov cysts is warranted, though one study suggested that cysts larger than 1.5 cm with associated radicular pain or bowel/bladder dysfunction may benefit the most from surgical intervention \\[[@bb0050]\\].\n\nWe recommend that patients presenting with symptomatic Tarlov cysts diagnosed by imaging should initially undergo conservative management with medication management, including acetaminophen, nonsteroidal anti-inflammatory drugs, and neuropathic pain medications such as gabapentin. Additionally, patients may respond to interventional pain procedures such as epidural steroid injections. Surgery should be reserved for patients who fail conservative management, given the high complication rates.\n\nWe would also like to comment on the success of spinal cord stimulation in this patient. SCS has been proven to be effective for treating intractable neuropathic pain such as lumbar radiculopathy and post-laminectomy syndrome \\[[@bb0060], [@bb0065], [@bb0070]\\]. There is also growing evidence that SCS can even be helpful for treating debilitating chronic visceral pelvic pain \\[[@bb0075]\\]. We believe this case is of importance as it describes the complicated management of patients with symptomatic Tarlov cysts who ultimately fail to respond to conservative therapy. We also describe the use of SCS in this patient and the benefit it can provide for patients who are suffering from severe radiculopathy after surgery as well as those with chronic pelvic pain ([Fig. 3](#f0015){ref-type=\"fig\"}).Fig. 3An example of an implantable high-frequency spinal cord stimulator system showing the percutaneous leads and implantable pulse generator.Fig. 3\n\n4. Conclusion {#s0020}\n=============\n\nTarlov cysts are an uncommon condition that present more often in women. This condition rarely becomes symptomatic, producing a variety of neurologic symptoms and painful conditions. Given the rarity of the condition and the high complication rates associated with surgery, there is no clear treatment algorithm for symptomatic patients. These cysts can be managed conservatively or surgically; surgical management has higher complication rates but better long-term results for symptom and cyst resolution. Patients who develop new or worsening pain after Tarlov cyst surgery may benefit from spinal cord stimulation. This case may provide guidance for physicians managing patients suffering from symptomatic Tarlov cysts, or worsening pain symptoms after surgical management of these cysts.\n\nContributors {#s0025}\n============\n\nJamal Hasoon contributed to the drafting, literature review, and critical revision of the article.\n\nAmnon A. Berger contributed to the drafting, literature review, and critical revision of the article.\n\nIvan Urits contributed to review and critical revision of the article.\n\nVwaire Orhurhu contributed to review and critical revision of the article.\n\nOmar Viswanath contributed to review and critical revision of the article.\n\nMusa Aner provided supervision, and contributed to review and critical revision of the article.\n\nConflict of Interest {#s0030}\n====================\n\nThe"}
{"id": 2, "inputs_pretokenized": "Introduction {#S1}\n============\n\nPorcine circovirus has long harmed the sound development of pig husbandry, and especially the PCV3 that has appeared in recent years has caused tremendous economic losses for pig husbandry ([@B17]; [@B21]). Current research indicates that PCV is mainly divided into three genotypes ([@B8]). PCV1 is generally considered non-pathogenic ([@B27]). PCV2 is widely prevalent worldwide, previous studies have shown that PCV2 is the main pathogenesis of post-weaning multisystemic wasting syndrome (PMWS) and swine dermatitis and nephrotic syndrome (PDNS) ([@B1]; [@B30]). However, in recent years, some researchers have detected PCV3 from PDNS piglets ([@B22]; [@B13]). Studies have shown that PCV3 and PCV2 are mixed infections and have become popular in many countries. It has been reported that PCV3 may cause reproduction disorder in sows and PDNS in adult pigs ([@B22]). Similar to PCV2, PCV3 is often mixed with PRRSV, PCV2 ([@B2]). However, unlike PCV2, there are currently commercial vaccines to prevent PCV2 infection ([@B23]), and there is still a shortage of vaccines and related drugs to prevent PCV3.\n\nObtaining standard virus strains is the basis for the development of PCV3 vaccines and related biological products. However, no experimental report on the successful isolation of PCV3 has been reported. With the development of genetic engineering technology, a variety of virus strains have been constructed through reverse genetics ([@B34]; [@B10]). With the continuous analysis of the genome structure and function of PCV2 and PCV3, researchers have obtained infectious clones by constructing eukaryotic expression vectors of PCV2 and PCV3 ([@B28]; [@B11]). According to the genome structure of PCV, the porcine circovirus genome is a single-stranded negative-stranded DNA, the virions are only 14--17 nm, and there is no capsule on the surface of the virus capsid ([@B18]; [@B32]). The size of the PCV1 and PCV2 genome research surface is 1767--1768 bp and contains 11 open reading frames (ORFs), of which ORF1 is a virus replication--related protein (Rep) and is a necessary element of virus replication ([@B3]). ORF2 encodes the viral capsid protein (Cap) ([@B20]) and is commonly used in the study of subunit vaccines and diagnostic reagents ([@B16]). Unlike the genomes of PCV1 and PCV2, the full length of the PCV3 genome is 2000 bp ([@B24]). Some researchers have predicted the PCV3 genomic DNA, and currently they have predicted a total of three ORFs ([@B22]). One Rep protein composed of 297 amino acids was encoded by ORF1 ([@B33]). Besides, another Cap protein covering 214 amino acids by ORF2 was replicated in the opposite direction and a protein with an unknown function and containing 231 amino acids by ORF3 ([@B5]). Whether PCV3 has other open reading frames and their functions still needs further study.\n\nThe above research is to construct infectious clones under the premise of grasping the genome structure of the virus. However, for some newly discovered circular DNA viruses, the genome structure and function are undefined yet, so it is hard to construct infectious clones with the application of the eukaryotic expression vector. This study intends to use the biological characteristics of PCV3 circular DNA to construct PCV3 infectious clones and construct a Kunming mouse infection model without the help of exogenous expression vectors. The results showed that the PCV3 strain can infect the myocardium and lung of mice. This study will provide a method for the construction of infectious clones of other circular DNA viruses and lay a foundation for the study of the pathogenic mechanism of PCV3.\n\nMaterials and Methods {#S2}\n=====================\n\nCells and Cultures {#S2.SS1}\n------------------\n\nThe 3D4/21 cell line (iCell Bioscience Inc., Shanghai, China) was cultivated in Dulbecco's minimum essential medium (MEM, Gibco) supplemented by 10% fetal bovine serum at 37°C in a humidified 5% CO~2~ incubator. The cloning and construction of recombinant expression plasmids was carried out in *E. coli* strain DH5α cells (Takara Bio, Dalian, China). The prokaryotic expression vector pET-32a (+) and *E. coli* BL21 (DE3) cells were harvested from the stocks of our laboratory. The SP2/0 cells were also acquired from the stocks.\n\nViral Gene and Primer Synthesis {#S2.SS2}\n-------------------------------\n\nThe PCV3 gene sequence (GenBank accession number: [MH107162.1](MH107162.1)) was taken to form a loop on Snap-Gene software, and the position of the unique restriction site was adopted to open the sequence, termed as the rearranged linear PCV3 gene sequence. Since the PCV3 is circular, the cyclization of the original linear DNA sequence was considered, the *Hin*dIII restriction site was recruited as the reopening site. When the opening process was completed, the *Hin*dIII restriction site was added to the end of the linear sequence. The newly rearranged sequence was synthesized by Sangon (Shanghai, China). [Figure 1](#F1){ref-type=\"fig\"} illustrates the gene pattern of the novel PCV3 and presents the design pattern of the circular PCV3 amplification primer and detection primer. Primers listed in [Table 1](#T1){ref-type=\"table\"} were designed in accordance with the rearranged PCV3 gene sequence and PCV3 Cap gene sequence; the designed primers were synthesized by Sangon (Shanghai, China).\n\n###### \n\nPrimers used for the construction and identification of the recombinant virus.\n\n  Primer Sequence\n  ---------------------------------------------------------------------\n  PCV3 M1: 5′-CCC[AAGCTT]{.ul}GTGCGGATGCGGCTGCGCG-3′;\n  PCV3 L2: 5′- CCC[AAGCTT]{.ul}CCCGCGTTTTCCCACAACC-3′;\n  PCV3 L3: 5′- GGTTGTGGGAAAACGCGGG-3′;\n  PCV3 M2: 5′-CGCGCAGCCGCATCCGCACAAGCTT-3′;\n  PCV3 Cap *Bam*HI: 5′-CGC[GGATCC]{.ul}ATGAGACACAGAGCTATATTCAGAA-3′;\n  PCV3 Cap *Hin*dIII: 5′-CCC[AAGCTT]{.ul}TTAGAGAACGGACTTGTAACGAATC-3′\n\nThe underlined sequences represent restriction enzyme sites introduced. PCV3 M1, PCV3 L2: PCV3 complete genome amplification primers; PCV3 L3 is a reverse complementary sequence of PCV3 L2; PCV3 M2 is the nucleotide sequence next to the primer binding site of PCV3 L2; PCV3 Cap BamHI, PCV3 Cap HindIII: The design of the primer is the reverse complement of the negative chain of PCV3 with the Cap gene sequence, and specific primers were then designed according to the reverse complementary DNA sequence.\n\n![PCV3 viral gene rearrangement. **(A)** Rearranged linear gene sequence of PCV3 containing *Hin*dIII restriction sites. The *Hin*dIII restriction site acted as the reopening site, added to the end of the linear sequence after the opening process. **(B)** PCR detection after PCV3 cyclization. Specific primers, covering PCV3 M2 and PCV3 L3, were designed to verify whether the PCV3 gene sequence was cyclized. However, the PCV3 linear sequence could not be amplified by the mentioned primers.](fmicb-11-01067-g001){#F1}\n\nAmplification and Cyclization of the PCV3 Genome {#S2.SS3}\n------------------------------------------------\n\nTo amplify the newly synthesized rearranged PCV3 gene, PCV3 M1, PCV3 L2 primers, and KFX-101 high fidelity enzymes (TOYOBO, Japan) were adopted. The final volume of reaction fluid reached 100 μL. The PCR cycling conditions included: pre-denaturation at 94°C for 2 min, 30 cycles at 98°C for 10 s, 58°C for 30 s, and 68°C for 2 min, as well as the final extension for 10 min at 68°C. PCR products were preserved at 16°C for subsequent experiments.\n\nThe amplified PCR products of rearranged PCV3 gene were purified following the instructions of the DNA Purification Kit (Takara Bio, Dalian, China). Subsequently, the purified PCR product was digested by *Hin*dIII restriction endonuclease (NEB, Beijing, China) and then"}
{"id": 3, "inputs_pretokenized": "1. Field of the Invention\nThe present invention relates to a motor drive apparatus which is, for example, used for driving an X-Y table of a monolithic wire bonder or a die bonder serving as one of IC manufacturing apparatus, and a method of controlling the same.\n2. Description of the Related Art\nThere is known a method of accurately stopping a motor at a target position, as disclosed in Unexamined Japanese Patent Application No. 55-77384/1980. In this prior art, after the motor passes through the target position, an error extreme point is obtained in order to determine a current value to be supplied to the motor to correct the error. Then, a rectangular current is supplied to the motor so as to eliminate the error and stop the motor at the target position.\nHereinafter, a background technology of the present invention will be explained. FIG. 10 is a block diagram showing one example of a motor drive apparatus controlling a typical three-phase synchronous motor. FIG. 11 is a detailed view showing a motor 1 of FIG. 10. FIG. 12 is a view showing inductive voltages of the motor 1 of FIG. 10. FIG. 13 is a view showing output signals from an encoder 2 shown in FIG. 10. FIG. 14 is a view showing an operation of a pulse converter 3 shown in FIG. 10. And, FIG. 15 is a detailed view showing a magnetic pole detector 4 of FIG. 10.\nIn FIG. 10, a reference numeral 1 represents a three-phase synchronous motor equipped with 9 slots and 6 poles. More specifically, as shown in FIG. 11, this three-phase synchronous motor comprises a stator 5 and a rotor 6. The stator 5 is associated with three coils of U-phase 7, V-phase 8, and W-phase 9 windings. This motor 1 has nine slots 10 disposed on an inside surface of the stator 5 which are spaced at intervals of 40 degrees. These nine slots 10 are wound by the coil windings in the order of U-phase, V-phase, and W-phase repetitively so as to form a star connection. On the other hand, the rotor 6 has six permanent magnet poles 11 disposed on the outer circumferential surface thereof.\nAn operational principle of the motor 1 will be explained below. The rotor 8 causes a magnetic field corresponding to its rotational position, which interacts with three, U-phase 7, V-phase 8, and W-phase 9, windings on the stator 5. Therefore, these three windings 7, 8, and 9 generate voltages due to Lorentz's force. Namely, three, U-phase 12, V-phase 13, and W-phase 14, inductive voltages of sine waveform are generated at intervals of 120 degrees as shown in FIG. 12 because a magnetic field to each winding is cyclically increased and decreased in response to spatial positioning of the permanent magnet 11 which cyclically approaches to and departs from each winding during one complete revolution of the rotor 6.\nIf sine-wave currents being in-phase with these inductive voltages of FIG. 12 are supplied to the U-phase 7, V-phase 8, and W-phase 9 windings, respectively, the rotor 6 generates a torque in a clockwise (abbreviated as CW) direction due to Fleming's left-hand rule. The magnitude of the torque generated is proportional to an amplitude of the current supplied. Moreover, if the above currents are further multiplied with -1 and delayed 180 degrees in phase before being supplied to respective windings, the rotor 6 generates a torque in a counterclockwise (abbreviated as CCW) direction.\nIn FIG. 10, a reference numeral 2 represents an optical encoder having three channels and installed on a rotor shaft of the motor 1. When the motor i rotates in the clockwise (CW) direction, the encoder 2 generates an A-phase signal 15 and a B-phase signal 18 having a mutual phase difference of 90 degrees therebetween as shown in FIG. 12, together with a Z-phase pulse signal 17 corresponding to one of zero-crossing 20 points of the U-phase inductive voltage 12. If the motor 1 rotates in the counterclockwise (CCW) direction, the phase relationship between the A-phase signal 15 and B-phase signal 16 are reversed. Therefore, the rotational direction of the motor 1 is easily judged by checking the phase relationship between the A-phase signal 15 and the B-phase signal 18.\nA reference numeral 3 represents a pulse converter connected to the encoder 2. This pulse converter 3 converts the A-phase and B-phase signals 15 and 18 into a CW pulse signal 18 as shown in FIG. 14 when the motor 1 rotates in the clockwise direction. On the contrary, this pulse converter 3 converts the A-phase and B-phase signals 15 and 16 into a CCW pulse signal 19 as shown in FIG. 14 when the motor 1 rotates in the counterclockwise direction. A reference numeral 4 represents a magnetic pole detector comprising a counter 20, a U-phase current phase command table 21, and a W-phase current phase command table 22. As shown in FIG. 15, the counter 20 receives the signals fed from the pulse converter 3 so as to effect its count-up and count-down operations in response to the CW pulse 18 and the CCW pulse 19, respectively. Furthermore, the counter 20 is connected to the encoder 2 so as to effect its clear operation in response to the Z-phase signal 17. The U-phase current phase command table 21 memorizes the phase of the U-phase inductive voltage 12 with respect to the Z-phase signal 17 of the encoder 2. The W-phase current phase command table 22 memorizes the phase of the W-phase inductive voltage 14 with respect to the Z-phase signal 17.\nAn operation of the magnetic pole detector 4 will be explained below. The counter 20 is cleared at the zero-cross point of the U-phase inductive voltage 12 in response to the Z-phase signal 17 fed from the encoder 2. When the motor 1 rotates, a rotational displacement or shift amount from the above zero-cross point of the U-phase inductive voltage 12 is counted by the counter 20. The counted value becomes a pointer 23 of the U-phase current phase command table 21 for outputting a phase value of the U-phase inductive voltage 12 corresponding to the present rotational position of the motor 1. In the same manner, the counted value of the counter 20 becomes a pointer 23 of the W-phase current phase command table 22 for outputting a phase value of the W-phase inductive voltage 14 corresponding to the present rotational position of the motor 1.\nThe magnetic pole detector 4 is connected to two multipliers 24U, 24W so that the phase values of the U-phase and W-phase inductive voltages 12 and 14 can be multiplied with an output of a speed control calculator 25. The speed control calculator 25 outputs a torque command value, i.e. a current amplitude command value. The multipliers 24U, 24W, therefore, multiply the current amplitude command value with the U-phase and W-phase current phase command values. The resultant two outputs from respective multipliers 24U, 24W are, then, fed to two D/A converters 28U, 28W so as to generate U-phase and W-phase current commands, respectively. These U-phase and W-phase current commands are, subsequently, fed to current amplifiers 27U, 27W in which drive currents to be supplied to the U-phase winding 7 and the W-phase winding 9 are generated in response to the U-phase and W-phase current commands, respectively.\nThe U-phase winding 7, the V-phase winding 8, and the W-phase winding 9 are connected with each other so as to constitute a star connection; therefore, the sum of currents flowing through these three-phase windings 7, 8, and 9 becomes 0. A current command for the V-phase winding 8 is, accordingly, identical with -(U-phase current command +W-phase current command). A subtracter 28 is therefore provided to obtain a V-phase current command equal to -(U-phase current command +W-phase current command). Thus obtained V-phase current command is, thereafter, fed to another current amplifier 27V in which a drive current to be supplied to the V-phase winding 8 is generated in response to the V-phase current command.\nA reference numeral 29 represents a speed detector connected to the pulse converter 3. This speed detector 29 detects the speed of the motor 1 by counting the number of pulses generated during a time measured by a timer 38 when the motor 1 rotates at a high speed and measuring an interval between successive pulses generated when the motor 1 rotates at a low speed. Reference numerals 31 and 32 represent a positive-direction position command pulse and a negative-direction position command pulse, respectively, fed from an external device. Reference numerals 33 and 34 represent subtracters.\nA"}
{"id": 4, "inputs_pretokenized": "---\nabstract: 'We study the effects of Supernova (SN) feedback on the formation of galaxies using hydrodynamical simulations in a $\\Lambda$CDM cosmology. We use an extended version of the code GADGET-2 which includes chemical enrichment and energy feedback by Type II and Type Ia SN, metal-dependent cooling and a multiphase model for the gas component. We focus on the effects of SN feedback on the star formation process, galaxy morphology, evolution of the specific angular momentum and chemical properties. We find that SN feedback plays a fundamental role in galaxy evolution, producing a self-regulated cycle for star formation, preventing the early consumption of gas and allowing disks to form at late times. The SN feedback model is able to reproduce the expected dependence on virial mass, with less massive systems being more strongly affected.'\n---\n\nIntroduction\n============\n\nSupernova explosions play a fundamental role in galaxy formation and evolution. On one side, they are the main source of heavy elements in the Universe and the presence of such elements substantially enhances the cooling of gas (White & Frenk 1991). On the other hand, SNe eject a significant amount of energy into the interstellar medium. It is believed that SN explosions are responsible of generating a self-regulated cycle for star formation through the heating and disruption of cold gas clouds, as well as of triggering important galactic winds such as those observed (e.g. Martin 2004). Smaller systems are more strongly affected by SN feedback, because their shallower potential wells are less efficient in retaining baryons (e.g. White & Frenk 1991).\n\nNumerical simulations have become an important tool to study galaxy formation, since they can track the joint evolution of dark matter and baryons in the context of a cosmological model. However, this has shown to be an extremely complex task, because of the need to cover a large dynamical range and describe, at the same time, large-scale processes such as tidal interactions and mergers and small-scale processes related to stellar evolution.\n\nOne of the main problems that galaxy formation simulations have repeteadly found is the inability to reproduce the morphologies of disk galaxies observed in the Universe. This is generally refered to as the angular momentum problem that arises when baryons transfer most of their angular momentum to the dark matter components during interactions and mergers (Navarro & Benz 1991; Navarro & White 1994). As a result, disks are too small and concentrated with respect to real spirals. More recent simulations which include prescriptions for SN feedback have been able to produce more realistic disks (e.g. Abadi et al. 2003; Robertson et al. 2004; Governato et al. 2007). These works have pointed out the importance of SN feedback as a key process to prevent the loss of angular momentum, regulate the star formation activity and produce extended, young disk-like components.\n\nIn this work, we investigate the effects of SN feedback on the formation of galaxies, focusing on the formation of disks. For this purpose, we have run simulations of a Milky-Way type galaxy using an extended version of the code [GADGET-2]{} which includes chemical enrichment and energy feedback by SN. A summary of the simulation code and the initial conditions is given in Section \\[simus\\]. In Section \\[results\\] we investigate the effects of SN feedback on galaxy morphology, star formation rates, evolution of specific angular momentum and chemical properties. We also investigate the dependence of the results on virial mass. Finally, in Section \\[conclusions\\] we give our conclusions.\n\nSimulations {#simus}\n===========\n\nWe use the simulation code described in Scannapieco et al. (2005, 2006). This is an extended version of the Tree-PM SPH code [GADGET-2]{} (Springel & Hernquist 2002; Springel 2005), which includes chemical enrichment and energy feedback by SN, metal-dependent cooling and a multiphase model for the gas component. Note that our star formation and feedback model is substantially different from that of Springel & Hernquist (2003), but we do include their treatment of UV background.\n\nWe focus on the study of a disk galaxy similar to the Milky Way in its cosmological context. For this purpose we simulate a system with $z=0$ halo mass of $\\sim 10^{12}$ $h^{-1}$ M$_\\odot$ and spin parameter of $\\lambda\\sim 0.03$, extracted from a large cosmological simulation and resimulated with improved resolution. It was selected to have no major mergers since $z=1$ in order to give time for a disk to form. The simulations adopt a $\\Lambda$CDM Universe with the following cosmological parameters: $\\Omega_\\Lambda=0.7$, $\\Omega_{\\rm m}=0.3$, $\\Omega_{\\rm b}=0.04$, a normalization of the power spectrum of $\\sigma_8=0.9$ and $H_0=100\\ h$ km s$^{-1}$ Mpc$^{-1}$ with $h=0.7$. The particle mass is $1.6\\times 10^7$ for dark matter and $2.4\\times 10^6$ $h^{-1}$ M$_\\odot$ for baryonic particles, and we use a maximum gravitational softening of $0.8\\ h^{-1}$ kpc for gas, dark matter and star particles. At $z=0$ the halo of our galaxy contains $\\sim 1.2\\times 10^5$ dark matter and $\\sim 1.5\\times 10^5$ baryonic particles within the virial radius.\n\nIn order to investigate the effects of SN feedback on the formation of galaxies, we compare two simulations which only differ in the inclusion of the SN energy feedback model. These simulations are part of the series analysed in Scannapieco et al. (2008), where an extensive investigation of the effects of SN feedback on galaxies and a parameter study is performed. In this work, we use the no-feedback run NF (run without including the SN energy feedback model) and the feedback run E-0.7. We refer the interested reader to Scannapieco et al. (2008) for details in the characteristics of these simulations.\n\nResults\n=======\n\nIn Fig. \\[maps\\] we show stellar surface density maps at $z=0$ for the NF and E-0.7 runs. Clearly, SN feedback has an important effect on the final morphology of the galaxy. If SN feedback is not included, as we have done in run NF, the stars define a spheroidal component with no disk. On the contrary, the inclusion of SN energy feedback allows the formation of an extended disk component.\n\n![Edge-on stellar surface density maps for the no-feedback (NF, left-hand panel) and feedback (E-0.7, right-hand panel) simulations at $z=0$. The colors span 4 orders of magnitude in projected density, with brighter colors representing higher densities. []{data-label=\"maps\"}](map-NF.eps \"fig:\"){width=\"60mm\"} ![Edge-on stellar surface density maps for the no-feedback (NF, left-hand panel) and feedback (E-0.7, right-hand panel) simulations at $z=0$. The colors span 4 orders of magnitude in projected density, with brighter colors representing higher densities. []{data-label=\"maps\"}](map-E-0.7.eps \"fig:\"){width=\"60mm\"}\n\n![Left: Star formation rates for the no-feedback (NF) and feedback (E-0.7) runs. Right: Mass fraction as a function of formation time for stars of the disk and spheroidal components in simulation E-0.7. []{data-label=\"sfr_stellarage\"}](sfr-copen.ps \"fig:\"){width=\"70mm\"}![Left: Star formation rates for the no-feedback (NF) and feedback (E-0.7) runs. Right: Mass fraction as a function of formation time for stars of the disk and spheroidal components in simulation E-0.7. []{data-label=\"sfr_stellarage\"}](fig6.ps \"fig:\"){width=\"64mm\"}\n\nThe generation of a disk component is closely related to the star formation process. In the left-hand panel of Fig. \\[sfr\\_stellarage\\] we show the star formation rates (SFR) for our simulations. In the no-feedback case (NF), the gas cools down and concentrates at the centre of the potential well very early, producing a strong starburst which feeds the galaxy spheroid. As a result of the early consumption of gas to form stars, the SFR is low at later times. On the contrary, the SFR obtained for the feedback case is lower at early times, indicating that SN feedback has contributed to self-regulate the star formation process. This is the result of the heating of gas and the generation of galactic winds. In this case, the amount of gas available for star formation is larger at recent times and consequently the SFR is higher. In the right-hand panel of Fig. \\[sfr\\_stellarage\\] we show the mass fraction as a function of formation time for stars of the disk and spheroidal components in our feedback simulation (see Scannapieco et al. 2008 for the method used to segregate stars into disk and spheroid). From this plot it is clear that star formation at recent times ($z\\"}
{"id": 5, "inputs_pretokenized": "Filed 7/31/19\n                            CERTIFIED FOR PUBLICATION\n\n                IN THE COURT OF APPEAL OF THE STATE OF CALIFORNIA\n\n                              FIRST APPELLATE DISTRICT\n\n                                       DIVISION ONE\n\n\n L’CHAIM HOUSE, INC. et al.,\n          Plaintiffs and Appellants,\n                                                   A152975\n v.\n DIVISION OF LABOR STANDARDS                       (Sonoma County\n ENFORCEMENT,                                      Super. Ct. No. SCV-259820)\n          Defendant and Respondent.\n\n\n        Plaintiffs L’Chaim House, Inc. and its owner, Cary Kopstein (collectively,\nL’Chaim), operate residential care homes for seniors. L’Chaim was cited for wage and\nhour violations by defendant Division of Labor Standards Enforcement (DLSE). After an\nunsuccessful administrative appeal, L’Chaim initiated this action by filing a petition for a\nwrit of administrative mandamus under Code of Civil Procedure section 1094.5, which\nthe trial court denied.\n        On appeal, L’Chaim claims that under the applicable Industrial Welfare\nCommission (IWC) wage order, it may require its employees to work “on-duty” meal\nperiods that, unlike periods when employees are “relieved of all duty,” do not need to be\nat least 30 minutes long. (IWC wage order No. 5-2001 (Cal. Code Regs., tit. 8, § 11050)\n(hereafter Wage Order No. 5), subd. (11)(A), (E).) We hold that, to the contrary,\nL’Chaim must provide meal periods of at least 30 minutes, regardless of whether they are\non-duty or off-duty, under Wage Order No. 5 and the applicable statutory law. We\ntherefore affirm.\n\n\n\n\n                                             1\n\f                                           I.\n                                 FACTUAL AND PROCEDURAL\n                                      BACKGROUND\n       Because this appeal presents a pure question of law, we need not discuss the\nunderlying facts in detail. Briefly, in February 2016, the DLSE issued wage and penalty\ncitations to L’Chaim, which operates two 24-hour residential care homes in San Rafael\nfor seniors. The citations were for, among other things, failing to provide 30-minute\nmeal periods under Wage Order No. 5, which governs the public housekeeping industry.\nA hearing officer affirmed the citations, which included a total of approximately $89,000\nin premium-pay and penalty assessments under Labor Code sections 226.7 and 558 for\nfailure to provide 30-minute meal periods to employees. 1\n       In December 2016, L’Chaim filed the instant action, challenging only the\nconclusion that it failed to provide meal periods as required. The following September,\nthe trial court denied the writ petition. It concluded that even though L’Chaim was\nauthorized to provide on-duty, as opposed to off-duty, meal periods to its employees,\nthose meal periods still had to be at least 30 minutes long.\n                                              II.\n                                         DISCUSSION\n       A.       The Standard of Review and Governing Law.\n       A writ of administrative mandamus may be sought on the basis that the agency\nengaged in a “prejudicial abuse of discretion. Abuse of discretion is established if the\n[agency] has not proceeded in the manner required by law.” (Code Civ. Proc., § 1094.5,\nsubd. (b).) “Generally, whether an agency has proceeded lawfully is a legal question that\nthe trial court and appellate court both review de novo.” (Stewart Enterprises, Inc. v.\nCity of Oakland (2016) 248 Cal.App.4th 410, 420.) We agree with the parties that\nL’Chaim’s sole claim—that the on-duty meal breaks authorized by subdivision 11(E) of\nWage Order No. 5 do not need to be least 30 minutes long—presents an issue of statutory\n\n\n\n\n       1\n           All further statutory references are to the Labor Code unless otherwise noted.\n\n                                               2\n\finterpretation that we review de novo. (See Robertson v. Health Net of California, Inc.\n(2005) 132 Cal.App.4th 1419, 1425.)\n       “We apply the usual rules of statutory interpretation to the Labor Code, beginning\nwith and focusing on the text as the best indicator of legislative purpose. [Citation.] ‘[I]n\nlight of the remedial nature of the legislative enactments authorizing the regulation of\nwages, hours[,] and working conditions for the protection and benefit of employees, the\nstatutory provisions are to be liberally construed with an eye to promoting such\nprotection.’ ” (Brinker Restaurant Corp. v. Superior Court (2012) 53 Cal.4th 1004,\n1026–1027 (Brinker).) Similarly, when, as here, “a wage order’s validity and application\nare conceded and the question is only one of interpretation, the usual rules of statutory\ninterpretation apply,” and the wage order “must be interpreted in the manner that best\neffectuates [the] . . . intent [to protect workers].” (Id. at p. 1027.) “To the extent a wage\norder and a statute overlap, we will seek to harmonize them, as we would with any two\nstatutes.” (Ibid.)\n       Wage Order No. 5, subdivision 11(A) provides, “No employer shall employ any\nperson for a work period of more than five (5) hours without a meal period of not less\nthan 30 minutes, except that when a work period of not more than six (6) hours will\ncomplete the day’s work the meal period may be waived by mutual consent of the\nemployer and the employee. Unless the employee is relieved of all duty during a 30\nminute meal period, the meal period shall be considered an ‘on duty’ meal period and\ncounted as time worked. An ‘on duty’ meal period shall be permitted only when the\nnature of the work prevents an employee from being relieved of all duty and when by\nwritten agreement between the parties an on-the-job paid meal period is agreed to. The\nwritten agreement shall state that the employee may, in writing, revoke the agreement at\nany time.”\n       Subdivision 11(E) of Wage Order No. 5 creates an exception for “employees of 24\nhour residential care facilities for the elderly,” which the DLSE concedes applies to\nL’Chaim’s employees. Under that provision, such employees “may be required to work\non-duty meal periods without penalty when necessary to meet regulatory or approved\n\n\n                                              3\n\fprogram standards and one of the following two conditions is met: [¶] (1) [¶] (a) The\nresidential care employee[] eats with residents during residents’ meals and the employer\nprovides the same meal at no charge to the employee; or [¶] (b) The employee is in sole\ncharge of the resident(s) and, on the day shift, the employer provides a meal at no charge\nto the employee.” (Wage Order No. 5, subd. 11(E).)\n       In 1999, the Legislature regulated meal periods for the first time by passing\nsection 512, which “made meal periods a statutory as well as a wage order obligation.”\n(Brinker, supra, 53 Cal.4th at pp. 1036–1037.) Before that, “an employer’s meal periods\nwere governed solely by the language of the IWC’s wage orders.” (Id. at p. 1034.) “The\ndeclared intent in enacting section 512,” which was done in response to the IWC’s\n“weakening of employee protections” in certain wage orders, “was not to revise existing\nmeal period rules but to codify them in part.” (Id. at pp. 1037–1038.) Under the statute,\n“[a]n employer shall not employ an employee for a work period of more than five hours\nper day without providing the employee with a meal period of not less than 30 minutes,\nexcept that if the total work period per day of the employee is no more than six hours, the\nmeal period may be waived by mutual consent of both the employer and employee.”\n(§ 512, subd. (a).) 2\n       B.      The On-duty Meal Periods Authorized by Subdivision 11(E) Must Be at\n               Least 30 Minutes Long.\n       L’Chaim’s claim that it does not have to provide on-duty meal periods that are 30\nminutes long rests on a fundamental misreading of subdivision 11 of Wage Order No. 5.\nAs noted above, subdivision 11(A) states that “[u]nless the employee is relieved of all\nduty during a 30 minute meal period, the meal period shall be considered an ‘on duty’\nmeal period and counted as time worked.” L’Chaim interprets this language to\n“contemplate[] instances where an employee’s meal period may be less than 30 minutes,”\nin which case subdivision 11(A) “does not"}
{"id": 6, "inputs_pretokenized": "/*\n *\t\tstree.c\n *      \n *      Copyright 2010 Alexander Petukhov <devel(at)apetukhov.ru>\n *      \n *      This program is free software; you can redistribute it and/or modify\n *      it under the terms of the GNU General Public License as published by\n *      the Free Software Foundation; either version 2 of the License, or\n *      (at your option) any later version.\n *      \n *      This program is distributed in the hope that it will be useful,\n *      but WITHOUT ANY WARRANTY; without even the implied warranty of\n *      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n *      GNU General Public License for more details.\n *      \n *      You should have received a copy of the GNU General Public License\n *      along with this program; if not, write to the Free Software\n *      Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,\n *      MA 02110-1301, USA.\n */\n\n/*\n *\t\tContains function to manipulate stack trace tree view.\n */\n\n#include <stdlib.h>\n#include <string.h>\n\n#ifdef HAVE_CONFIG_H\n\t#include \"config.h\"\n#endif\n#include <geanyplugin.h>\n\n#include \"stree.h\"\n#include \"breakpoints.h\"\n#include \"utils.h\"\n#include \"debug_module.h\"\n#include \"pixbuf.h\"\n\n#include \"cell_renderers/cellrendererframeicon.h\"\n\n/* Tree view columns */\nenum\n{\n   S_FRAME, /* the frame if it's a frame, or NULL if it's a thread */\n   S_THREAD_ID,\n   S_ACTIVE,\n   S_N_COLUMNS\n};\n\n/* active thread and frame */\nstatic glong active_thread_id = 0;\nstatic int active_frame_index = 0;\n\n/* callbacks */\nstatic select_frame_cb select_frame = NULL;\nstatic select_thread_cb select_thread = NULL;\nstatic move_to_line_cb move_to_line = NULL;\n\n/* tree view, model and store handles */\nstatic GtkWidget *tree = NULL;\nstatic GtkTreeModel *model = NULL;\nstatic GtkTreeStore *store = NULL;\n\nstatic GtkTreeViewColumn *column_filepath = NULL;\nstatic GtkTreeViewColumn *column_address = NULL;\n\n/* cell renderer for a frame arrow */\nstatic GtkCellRenderer *renderer_arrow = NULL;\n\nstatic GType frame_get_type (void);\nG_DEFINE_BOXED_TYPE(frame, frame, frame_ref, frame_unref)\n#define STREE_TYPE_FRAME (frame_get_type ())\n\n/* finds the iter for thread @thread_id */\nstatic gboolean find_thread_iter (gint thread_id, GtkTreeIter *iter)\n{\n\tgboolean found = FALSE;\n\n\tif (gtk_tree_model_get_iter_first(model, iter))\n\t{\n\t\tdo\n\t\t{\n\t\t\tgint existing_thread_id;\n\n\t\t\tgtk_tree_model_get(model, iter, S_THREAD_ID, &existing_thread_id, -1);\n\t\t\tif (existing_thread_id == thread_id)\n\t\t\t\tfound = TRUE;\n\t\t}\n\t\twhile (! found && gtk_tree_model_iter_next(model, iter));\n\t}\n\n\treturn found;\n}\n\n/* \n * frame arrow clicked callback\n */\nstatic void on_frame_arrow_clicked(CellRendererFrameIcon *cell_renderer, gchar *path, gpointer user_data)\n{\n    GtkTreePath *new_active_frame = gtk_tree_path_new_from_string (path);\n    if (gtk_tree_path_get_indices(new_active_frame)[1] != active_frame_index)\n\t{\n\t\tGtkTreeIter thread_iter;\n\t\tGtkTreeIter iter;\n\t\tGtkTreePath *old_active_frame;\n\n\t\tfind_thread_iter (active_thread_id, &thread_iter);\n\t\told_active_frame = gtk_tree_model_get_path (model, &thread_iter);\n\n\t\tgtk_tree_path_append_index(old_active_frame, active_frame_index);\n\n\t\tgtk_tree_model_get_iter(model, &iter, old_active_frame);\n\t\tgtk_tree_store_set (store, &iter, S_ACTIVE, FALSE, -1);\n\n\t\tactive_frame_index = gtk_tree_path_get_indices(new_active_frame)[1];\n\t\tselect_frame(active_frame_index);\n\n\t\tgtk_tree_model_get_iter(model, &iter, new_active_frame);\n\t\tgtk_tree_store_set (store, &iter, S_ACTIVE, TRUE, -1);\n\n\t\tgtk_tree_path_free(old_active_frame);\n\t}\n\n\tgtk_tree_path_free(new_active_frame);\n}\n\n/* \n * shows a tooltip for a file name\n */\nstatic gboolean on_query_tooltip(GtkWidget *widget, gint x, gint y, gboolean keyboard_mode, GtkTooltip *tooltip, gpointer user_data)\n{\n\tGtkTreePath *tpath = NULL;\n\tGtkTreeViewColumn *column = NULL;\n\tgboolean show = FALSE;\n\tint bx, by;\n\tgtk_tree_view_convert_widget_to_bin_window_coords(GTK_TREE_VIEW(widget), x, y, &bx, &by);\n\n\tif (gtk_tree_view_get_path_at_pos(GTK_TREE_VIEW(widget), bx, by, &tpath, &column, NULL, NULL))\n\t{\n\t\tif (2 == gtk_tree_path_get_depth(tpath))\n\t\t{\n\t\t\tgint start_pos, width;\n\t\t\tgtk_tree_view_column_cell_get_position(column, renderer_arrow, &start_pos, &width);\n\t\t\t \n\t\t\tif (column == column_filepath)\n\t\t\t{\n\t\t\t\tframe *f;\n\t\t\t\tGtkTreeIter iter;\n\t\t\t\tgtk_tree_model_get_iter(model, &iter, tpath);\n\t\t\t\t\n\t\t\t\tgtk_tree_model_get(model, &iter, S_FRAME, &f, -1);\n\t\t\n\t\t\t\tgtk_tooltip_set_text(tooltip, f->file);\n\t\t\t\t\n\t\t\t\tgtk_tree_view_set_tooltip_row(GTK_TREE_VIEW(widget), tooltip, tpath);\n\t\t\n\t\t\t\tshow = TRUE;\n\n\t\t\t\tframe_unref(f);\n\t\t\t}\n\t\t\telse if (column == column_address && bx >= start_pos && bx < start_pos + width)\n\t\t\t{\n\t\t\t\tgtk_tooltip_set_text(tooltip, gtk_tree_path_get_indices(tpath)[1] == active_frame_index ? _(\"Active frame\") : _(\"Click an arrow to switch to a frame\"));\n\t\t\t\tgtk_tree_view_set_tooltip_row(GTK_TREE_VIEW(widget), tooltip, tpath);\n\t\t\t\tshow = TRUE;\n\t\t\t}\n\t\t}\n\t\tgtk_tree_path_free(tpath);\n\t}\n\t\n\treturn show;\n}\n\n/* \n * shows arrow icon for the frame rows, hides renderer for a thread ones\n */\nstatic void on_render_arrow(GtkTreeViewColumn *tree_column, GtkCellRenderer *cell, GtkTreeModel *tree_model,\n\tGtkTreeIter *iter, gpointer data)\n{\n\tGtkTreePath *tpath = gtk_tree_model_get_path(model, iter);\n\tg_object_set(cell, \"visible\", 1 != gtk_tree_path_get_depth(tpath), NULL);\n\tgtk_tree_path_free(tpath);\n}\n\n/* \n * empty line renderer text for thread row\n */\nstatic void on_render_line(GtkTreeViewColumn *tree_column, GtkCellRenderer *cell, GtkTreeModel *tree_model,\n\tGtkTreeIter *iter, gpointer data)\n{\n\tframe *f;\n\n\tgtk_tree_model_get (model, iter, S_FRAME, &f, -1);\n\n\tif (! f)\n\t\tg_object_set(cell, \"text\", \"\", NULL);\n\telse\n\t{\n\t\tGValue value = G_VALUE_INIT;\n\n\t\tg_value_init(&value, G_TYPE_INT);\n\t\tg_value_set_int (&value, f->line);\n\t\tg_object_set_property (G_OBJECT (cell), \"text\", &value);\n\n\t\tg_value_unset (&value);\n\t\tframe_unref (f);\n\t}\n}\n\n/* \n * shows only the file name instead of a full path\n */\nstatic void on_render_filename(GtkTreeViewColumn *tree_column, GtkCellRenderer *cell, GtkTreeModel *tree_model,\n\tGtkTreeIter *iter, gpointer data)\n{\n\tframe *f;\n\n\tgtk_tree_model_get(model, iter, S_FRAME, &f, -1);\n\n\tif (! f)\n\t\tg_object_set(cell, \"text\", \"\", NULL);\n\telse\n\t{\n\t\tgchar *name;\n\n\t\tname = f->file ? g_path_get_basename(f->file) : NULL;\n\t\tg_object_set(cell, \"text\", name ? name : f->file, NULL);\n\n\t\tg_free(name);\n\t\tframe_unref (f);\n\t}\n}\n\n/*\n *  Handles same tree row click to open frame position\n */\nstatic gboolean on_msgwin_button_press(GtkWidget *widget, GdkEventButton *event, gpointer user_data)\n{\n\tif (event->type == GDK_BUTTON_PRESS)\n\t{\n\t\tGtkTreePath *pressed_path = NULL;\n\t\tGtkTreeViewColumn *column = NULL;\n\t\tif (gtk_tree_view_get_path_at_pos(GTK_TREE_VIEW(tree), (int)event->x, (int)event->y, &pressed_path, &column, NULL, NULL))\n\t\t{\n\t\t\tif (2 == gtk_tree_path_get_depth(pressed_path))\n\t\t\t{\n\t\t\t\tGtkTreePath *selected_path;\n\t\t\t\tgtk_tree_view_get_cursor(GTK_TREE_VIEW(tree), &selected_path, NULL);\n\n\t\t\t\tif (selected_path && !gtk_tree_path_compare(pressed_path, selected_path))\n\t\t\t\t{\n\t\t\t\t\tframe *f;\n\t\t\t\t\tGtkTreeIter iter;\n\t\t\t\t\tgtk_tree_model_get_iter (\n\t\t\t\t\t\t model,\n\t\t\t\t\t\t &iter,\n\t\t\t\t\t\t pressed_path);\n\n\t\t\t\t\tgtk_tree_model_get (model, &iter, S_FRAME, &f, -1);\n\t\t\t\t\t\n\t\t\t\t\t/* check if file name is not empty and we have source files for the frame */\n\t\t\t\t\tif (f->have_source)\n\t\t\t\t\t{\n\t\t\t\t\t\tmove_to_line(f->file, f->line);\n\t\t\t\t\t}\n\n\t\t\t\t\tframe_unref(f);\n\t\t\t\t}\n\n\t\t\t\tif (selected_path)\n\t\t\t\t\tgtk_tree_path_free(selected_path);\n\t\t\t}\n\n\t\t\tgtk_tree_path_free(pressed_path);\n\t\t}\n\t}\n\n\treturn FALSE;\n}\n\n/*\n *  Tree view cursor changed callback\n */\nstatic void on_cursor_changed(GtkTreeView *treeview, gpointer user_data)\n{\n\tGtkTreePath *path;\n\tGtkTreeIter iter;\n\tframe *f;\n\tint thread_id;\n\n\tgtk_tree_view_get_cursor(treeview, &path, NULL);\n\tif (! path)\n\t\treturn;\n\n\tgtk_tree_model_get_iter (model, &iter, path);\n\tgtk_tree"}
{"id": 7, "inputs_pretokenized": "Question: Apple sold 100 iPhones at their New York store today for an average cost of $1000. They also sold 20 iPads for an average cost of $900 and 80 Apple TVs for an average cost of $200. What was the average cost across all products sold today?\nAnswer:The sales for iPhones were 100 iPhones * $1000 per iPhone on average = $<<100*1000=100000>>100,000\nThe sales for iPads today were 20 iPads * $900 per iPad = $<<20*900=18000>>18,000\nThe sales for Apple TV’s today were 80 * $200 = $<<80*200=16000>>16,000\nThe total sales for Apple at their New York store today was $100,000 + $18,000 + $16,000 = $<<100000+18000+16000=134000>>134,000\nThe total number of products sold was 100 + 20 + 80 = <<100+20+80=200>>200\nThe average cost per product sold was $134,000 total sales / 200 total products = $<<134000/200=670>>670\n####"}
{"id": 8, "inputs_pretokenized": "Introduction {#S0001}\n============\n\nThe health and progress of any society largely depends on the health of its women. Women experience many biological changes throughout their life that have a significant impact on their health, including pregnancy and lactation.[@CIT0001] Pregnancy changes women's lifestyle and they should at least begin to lead a healthy lifestyle and perform health-promoting behaviors during this critical period in order to avoid problems that could harm themselves or the embryo.[@CIT0002] Health-promoting behaviors during pregnancy reduce the likelihood of preterm delivery, the need for cesarean section and the risk of obesity and diabetes.[@CIT0003] Failure in observing such behaviors can lead to complications during pregnancy, such as bleeding and maternal infection, multiple admissions to intensive care units, low birth weight or early neonatal death.[@CIT0001] Since providing maternal and newborn health services is one of the priorities of health systems,[@CIT0004] various strategies have been considered by healthcare providers to ensure the health of pregnant women, which involves health-promoting behaviors and a healthy lifestyle.[@CIT0005] Given women's role in maintaining their family's health, these behaviors are important for all members of the society, especially women.[@CIT0006],[@CIT0007] According to statistics provided by the WHO, 60% of people's quality of life and health status depends on their own behaviors and lifestyle.[@CIT0008],[@CIT0009] According to the literature, \"a health-promoting lifestyle is a multi-dimensional pattern of self-initiated feelings and behaviors aiming at ensuring individual's health, self-actualization, and self-accomplishment.[@CIT0010],[@CIT0011]\"\n\nThese behaviors include any measures taken to maintain and enhance the health of an individual or a group.[@CIT0012],[@CIT0013] Health-promoting behaviors should be further emphasized because the promotion of health in society is a dynamic process of empowering individuals to control their health based on first-grade preventive interventions and is focused on positive lifestyle changes.[@CIT0014],[@CIT0015] Pregnant women's lifestyle includes the way they work and rest, their type of nutrition, their manner of coping with stress or communicating with others and also prenatal care.[@CIT0008] The factors affecting health-promoting behaviors should be determined in pregnant women in order to promote their healthy behaviors.[@CIT0007] Multiple behavior change theories and models have been proposed by researchers due to the complexity of behaviors and the challenges of creating, maintaining and improving health-promoting behaviors.[@CIT0016] Some theories and models have identified the most important multi-faceted factors affecting a behavior and the relationship between these factors.[@CIT0017] Pender's health promotion model is one of the comprehensive models used for accomplishing health-promoting behaviors[@CIT0015] and has been recognized as a framework for explaining healthy lifestyle and health-promoting behaviors. This model serves as a guide in discovering individuals' complex biological-psychological processes in order to promote their health behaviors and explains how individuals make decisions about their health-promoting behaviors.[@CIT0011],[@CIT0018] The studies conducted by Pender et al[@CIT0019],[@CIT0020],[@CIT0021] have revealed the dimensions of health-promoting behaviors as spiritual growth, health responsibility, physical activity, nutrition, interpersonal relations, and stress management. Given the importance of women's status in society and their role in the overall development of the country, appropriate planning and policy-making for improving women's status and facilitating their progress should take account of their health status and identify its contributing factors.[@CIT0022] This study was conducted based on Pender's health promotion model to investigate the predictors of pregnant women's health-promoting lifestyles, since it is necessary to study and identify the factors affecting these behaviors separately for each group of the community.[@CIT0023] The results of this study might work as a basis for ensuring a higher quality of life in this vulnerable group of society.\n\nMethods {#S0002}\n=======\n\nThis descriptive research was designed to determine the predictors of a health-promoting lifestyle in pregnant women based on the constructs of Pender's health promotion model and examine the correlation between the model constructs and lifestyle. The sample included pregnant women in Yazd Province who were selected from 2018 to 2019. The sample size was obtained as 259 using the sample size equation, type-I error probability of α=0.05, test power of 1-β=0.90 and Pearson's correlation coefficient of r=0.20; ultimately, 300 individuals were included in the study to take account of a 15% probability of sample loss.\n\nAfter making the necessary arrangements, the samples were selected through simple random sampling from pregnant women in the second and third trimesters of their pregnancy, covered by one of the community health centers of Yazd Province. The pregnant women with problems such as high-risk pregnancy (bleeding, membrane rupture, preeclampsia or eclampsia and gestational diabetes with insulin injections) or pre-pregnancy physical problems were excluded from the study. Before completing the questionnaires, the participants were briefed on the research objectives and gave their written consent. The research was carried out in accordance with the Declaration of Helsinki.\n\nThe participants were carefully monitored during their completion of the questionnaires. Data were collected using a demographic questionnaire, the Health-Promoting Lifestyle Profile II (HPLP-II) and a questionnaire based on Pender's model constructs.\n\nDemographic Questionnaire {#S0002-S2001}\n-------------------------\n\nThe demographic questionnaire inquired about variables such as age, the woman's education and employment status, the husband's education and employment status, gestational age and the woman's BMI.\n\nHealth-Promoting Lifestyle Profile II (HPLP-II) {#S0002-S2002}\n-----------------------------------------------\n\nHealth-promoting behaviors were measured using the HPLP-II, designed by Pender et al (as described in ref.[@CIT0001]). This questionnaire consists of 52 items and measures health-promoting lifestyle behaviors within six dimensions: Physical activity (eight items), nutrition (nine), spiritual growth (nine), interpersonal relations (nine), stress management (eight) and health responsibility (nine items). The questionnaire items are scored based on a 4-point Likert scale: Never (1 point), sometimes (2 points), often (3 points) and always (4 points). The mean score of each dimension is calculated, and the total lifestyle score is then calculated by adding these scores. Higher scores indicate more favorable behaviors. The validity and reliability of this instrument have been confirmed in numerous studies.[@CIT0009],[@CIT0020],[@CIT0024],[@CIT0025] This questionnaire has also been translated in Iran, and the validity and reliability of the Persian version have been confirmed in several studies.[@CIT0026],[@CIT0027]\n\nQuestionnaire Based on Pender's Model Constructs {#S0002-S2003}\n------------------------------------------------\n\nPender's health promotion model was examined in this study according to Mohammadian's research,[@CIT0018] which was conducted on the constructs of perceived self-efficacy, affect, social support and benefits, and barriers. This study used the perceived self-efficacy construct of the Health Locus of Control Scale adapted by Smith et al. The Health Locus of Control Scale consists of eight items scored based on a 5-point Likert scale, ranging from strongly disagree (1 point) to strongly agree (5 points). The score ranges from 8 to 40 in this scale. Higher scores indicate the individual's greater ability to control the outcomes and consequences of health-related programs. The Cronbach's alpha coefficient calculated for this instrument by Smith et al was 0.84 (as described in ref. [@CIT0018]). The affect construct was evaluated using an assessment tool adapted by Watson et al. This assessment tool contains 20 items, including ten on positive affect and ten on negative affect, and is scored based on a 5-point Likert scale, ranging from never (1 point) to always (5 points). The score obtained for each of the positive and negative affects ranges from 10 to 50. Higher scores indicate better reported emotional states over the past 24 hours. The Cronbach's alpha coefficient reported by Watson et al was 0.94 for positive affect and 0.91 for negative affect.[@CIT0018] The social support construct was evaluated using an assessment tool adapted by Canty et al, including 12 items scored based on a 7-point Likert scale (strongly disagree =1 point, to strongly agree =7 points). The score obtained ranges from 12 to 84. Higher scores indicate greater support from friends, family and other key people. The Cronbach's alpha coefficient reported by Canty et al for this assessment tool was 0.91.[@CIT0018] The perceived barriers construct was evaluated using an assessment tool adapted by Becker et al, which has 18 items scored based on a 4-point Likert scale (never =1 point, to always =4 points). The score obtained for"}
{"id": 9, "inputs_pretokenized": "Question: The grocery store sells chips for $2 per packet and corn chips for $1.5 per packet. John would like to buy 15 packets of chips, and with the rest of the money he has left, buy as many packets of corn chips as he can. How many packets of corn chips could John buy if he has $45 for his entire purchase?\nAnswer:John wants to buy 15 packets of chips, which will cost him 15 * 2 = $<<15*2=30>>30.\nSo John would have 45 - 30 = $<<45-30=15>>15 left for the corn chips.\nJohn could buy for the rest of the money 15 / 1.5 = <<15/1.5=10>>10 packets of corn chips.\n####"}
{"id": 10, "inputs_pretokenized": "1. Introduction {#sec1}\n===============\n\nSoil organic C (SOC) and total N (TN) are very important C and N pools in the terrestrial ecosystems \\[[@B1], [@B2]\\]. As the components of labile C and N pools in soils, dissolved organic C (DOC) and N (DON) and soil ammonium and nitrate N (NH~4~ ^+^-N and NO~3~ ^−^-N) play crucial roles in the biogeochemistry of C and N and in the nutrient transformation \\[[@B3]--[@B5]\\]. With the context of climatic warming, how SOC, TN, DOC, DON, NH~4~ ^+^-N, and NO~3~ ^−^-N respond is vital to global C and N cycling \\[[@B1], [@B2]\\]. However, inconsistent results on the responses of these C and N pools to climatic warming have been observed with respect to vegetation types and initial soil characteristics \\[[@B2], [@B3], [@B6]--[@B14]\\]. For example, He et al. \\[[@B2]\\] demonstrated that six-year warming (\\~1.4°C increase of 10 cm soil temperature) significantly decreased soil C by 129.3 g m^−2^ in a temperate steppe of Inner Mongolia. In contrast, Li et al. \\[[@B7]\\] found that two-year warming significantly increased SOC in an alpine meadow (\\~2.1°C increase of air temperature) but significantly reduced TN in an alpine swamp meadow (\\~2.3°C increase of air temperature) on the Tibetan Plateau. Hagedorn et al. \\[[@B13]\\] indicated that one-growing-season warming (\\~4°C increase of 5 cm soil temperature) did not significantly influence DOC. Song et al. \\[[@B1]\\] pointed out that six-year warming (\\~1.2°C increase of 10 cm soil temperature) significantly reduced DOC in a temperate steppe in Inner Mongolia. Biasi et al. \\[[@B15]\\] indicated that two-year warming (\\~0.9°C increase of 5 cm soil temperature) did not have obvious effects on DON, NH~4~ ^+^-N, NO~3~ ^−^-N, and N~min⁡~ in a lichen-rich dwarf shrub tundra in Siberia. Bai et al. \\[[@B14]\\] stated that experimental warming (\\~0.6--6.7°C in soil temperature) had a significant positive effect on N~min⁡~ but not on TN across all biomes. Therefore, how climatic warming acts on C and N cycling still remains unclear.\n\nMore than 70% of the Tibetan Plateau is covered with grasslands \\[[@B16]\\]. The alpine grasslands of this Plateau are one of the systems most sensitive to global change \\[[@B17], [@B18]\\]. In alpine grasslands, understanding the responses of SOC, DOC, TN, DON, NH~4~ ^+^-N, and NO~3~ ^−^-N to climatic warming are crucial for predicting future changes in soil fertility and C sequestration. The alpine meadow is one of the most typical grasslands types on the Tibetan Plateau being subjected to climatic warming \\[[@B19]\\]. Information on how these C and N pools along an elevation gradient respond to climatic warming is scarce on the Tibetan Plateau. Here we set up a warming experiment in an alpine meadow at three elevations (i.e., 4313 m, 4513 m, and 4693 m) on the Northern Tibetan Plateau.\n\nThe main objective was to investigate the effects of short-term experimental warming on SOC, TN, DOC, DON, NH~4~ ^+^-N, and NO~3~ ^−^-N. Our previous study indicated that short-term experimental warming could not affect soil microbial biomass \\[[@B20]\\] and soil microbial activity regulated the balances of soil C and N pools in the alpine meadow \\[[@B21]\\]. We hypothesized that experimental warming may not affect these C and N pools in this study.\n\n2. Materials and Methods {#sec2}\n========================\n\n2.1. Study Area, Experimental Design, and Soil Sampling {#sec2.1}\n-------------------------------------------------------\n\nA detailed description of the study area, the warming experimental design, the measurements of microclimate factors (including soil temperature and soil moisture), and the soil sampling are given in Fu et al. \\[[@B20], [@B22]\\].\n\nBriefly, three alpine meadow sites were established at three elevations (i.e., a low (30°30′N, 91°04′E, and 4313 m), mid- (30°31′N, 91°04′E, and 4513 m), and high (30°32′N, 91°03′E, and 4693 m) elevation) at Damxung Grassland Observation Station of Tibet Autonomous Region in China in May 2010.\n\nAnnual mean air temperature and precipitation is 1.3°C and \\~476.8 mm, respectively \\[[@B20], [@B21]\\]. The vegetation is*Kobresia*-dominated alpine meadow and roots are mainly concentrated in the topsoil layer (0--20 cm) \\[[@B21], [@B22]\\]. The soil is classified as sandy loam, with pH of 6.0--6.7, organic matter of 0.3--11.2%, and total N of 0.03--0.49% \\[[@B20], [@B22]\\].\n\nOpen top chambers (OTCs, 3 mm thick polycarbonate) were used to enhance temperature \\[[@B22], [@B23]\\]. The bottom and top diameters and the height of OTCs were 1.45 m and 1.00 m and 0.40 m, respectively \\[[@B20], [@B22]\\]. For each site, four OTCs and their paired control plots (1 m × 1 m) were randomly established in May 2010. There was \\~3 m distance between plots.\n\nDaily mean soil temperature (*T* ~*s*~) during the study period of July-September in 2011 inside the OTCs increased by 1.26°C, 0.98°C, and 1.37°C at the low, mid-, and high elevation, respectively, compared to control plots \\[[@B20]\\]. In contrast, experimental warming decreased daily mean soil moisture (SM) by 0.04 m^3^ m^−3^ in all sites \\[[@B20]\\]. Daily mean *T* ~*s*~ decreased with increasing elevation from the low to high elevation \\[[@B20]\\].\n\nWe collected topsoil samples (0--20 cm depth) inside each plot using a probe 3.0 cm in diameter on July 7, August 9, and September 10, 2011 \\[[@B20]\\]. Five soil subsamples were randomly sampled and composited into one soil sample for each plot \\[[@B20]\\]. Subsamples of the fresh soil were used to measure DOC, DON, NH~4~ ^+^-N, and NO~3~ ^−^-N and other subsamples of the fresh soil were air-dried for the measurements of SOC and TN.\n\n2.2. Soil Analysis {#sec2.2}\n------------------\n\nA more detailed description of measurements of soil inorganic N (N~min⁡~, i.e., sum of NH~4~ ^+^-N and NO~3~ ^−^-N), DON, and DOC can be found in Fu et al. \\[[@B21]\\]. Briefly, soil inorganic N in 20 g fresh soil sample was extracted with 100 mL K~2~SO~4~, filtered through 0.45 *μ*m membrane, and analyzed on a LACHAT Quikchem Automated Ion Analyzer. Dissolved organic C and TN (DTN) in another 20 g fresh soil sample was extracted with 100 mL ultrapure water and filtered through 0.45 membrane. The extractable SOC and TN concentrations in the ultrapure water extracts were measured using a Liqui TOC II elementar analyzer (Elementar Liqui TOC, Elementar Co., Hanau, Germany) and a UV-1700 PharmaSpec visible spectrophotometer (220 nm and 275 nm), respectively. We also analyzed dissolved inorganic N (DIN) in the ultrapure water extracts on a LACHAT Quikchem Automated Ion Analyzer. Then DON was calculated as the difference between DTN and DIN. The potassium dichromate method was used to determine SOC \\[[@B24]\\]. Soil TN"}
