{"id": 0, "inputs_pretokenized": "‘Well, this is weird, isn’t it?” says Damon Albarn. Six days ago, he was in Mexico City, playing with Gorillaz. Now, he and his bandmates in the Good, the Bad & the Queen are in Kent, taking turns to explain their second album in a fake American diner adjacent to the Maidstone studio where they will be performing on Later … with Jools Holland.\n\nThe seats are regulation red leatherette, and there are pictures on the wall of Stevie Wonder circa 1980’s Hotter Than July, a Ford truck and a Route 66 sign. And under glaring lights, as he picks at a vegetarian dinner in a polystyrene box, Albarn is talking about things that feel as if they have no place here at all: English folk myths; the north of England’s coastal resorts; his family’s background in Lincolnshire, Nottinghamshire and Yorkshire – and, more than anything, Brexit. Harking back almost 25 years, he describes the new album as “the next instalment of Parklife. Like Parklife is a world, this is another world. Not entirely the real world, but not entirely far off it.”\n\nMerrie Land comes nearly 12 years after its predecessor. Like that record, this one was created by Albarn, former Clash bassist Paul Simonon, the trailblazing Nigerian drummer Tony Allen and guitarist/keyboard player Simon Tong (late of the Verve). After that, the similarities end. As if to illustrate the kind of openness and diversity that Albarn thinks Brexit might imperil, the new album has a broader musical palette. Not for nothing has Simonon described Merrie Land as a work of “modern English folk music with a bit of rub-a-dub in it”.\n\n“This time around, people can dance,” says Allen, a youthful 78, with the easy confidence that comes from having made breathtakingly original music since the 1960s. “Even without getting up, they can still have their body moving to the music. Everything is in there. With the first record, people asked me: ‘Tony Allen – what the fuck are you doing on this album? We don’t hear you.’ This time around, nobody’s going to ask me that. They can hear me on every track.”\n\nBrexit is wrong. Jacob Rees-Mogg and people in Blackpool should never be together\n\nThe biggest shift, though, is in the album’s theme. The first record portrayed the murky, bohemian parts of Albarn and Simonon’s west London home turf. To evoke the contorted confusion of Brexit, Merrie Land widens its focus beyond the capital and has an even sharper sense of place. There are moments when Albarn suspends his usual fondness for dealing in mood and texture, rather than lyrical specifics, and clearly speaks his mind.\n\nThe title track is a perfect example, featuring more pointedly political lyrics than Albarn has ever previously written. One of its most plainspoken passages questions the strange alliance between a swathe of working-class Brexit voters and the privately educated opportunists who style themselves as their leaders: “You were the ones who work together / Put the money in the pockets / Of the few and their fortunes / Who crowd the school benches / And jeer at us all because they don’t care about us / They are graceless and you shouldn’t be with them.”\n\nWatch the video for Merrie Land\n\nHe doesn’t understand why so many people apparently are with “them”. “That’s what I’m really upset about,” he says. “But because my family come from the north, and I grew up in Essex in the 80s, I can feel a great affinity with [Brexit voters] as well.\n\n“But this” – he means Brexit – “is wrong. Jacob Rees-Mogg and people in Blackpool should never be together. Unless Jacob Rees-Mogg is prepared to go to Blackpool on a Saturday night and have a fucking great time.”\n\nThe referendum result arrived a few hours before Albarn and the Orchestra of Syrian Musicians were set to perform at Glastonbury 2016. “We had this great performance ready and none of the Syrians could really understand why a lot of us were so upset and shocked,” he says. “If I’d had any idea that we were going to act as a people in the way that we have – prior and post – I would definitely have come back a lot earlier, if you know what I mean. As a person who loves their country, I would have expressed a very strong opinion. In public.”\n\nDoes he regret not having done that? “Well, I had no idea. I don’t know if I should tell you this. It’s too political …” He mentions Ian Birrell, the journalist who briefly worked as David Cameron’s speechwriter. He and Albarn co-founded Africa Express, an organisation that aims to break down cultural barriers by bringing together musicians from different countries. “He texted Cameron on Thursday [the day of the vote], just at the airport before we were flying to Bristol, to say: ‘What do you think is going to happen?’ And the text came back: ‘It’s going to be fine.’\n\n“So I would imagine there were quite a few people who were surprised. It was very strange. Strange times. And from that point onwards, I’ve been thinking about how to express how I feel about it all.”\n\nI wanted to begin to understand how this abyss had opened up in the centre of our culture\n\nSome of Merrie Land’s key songs began to cohere in Blackpool, where 67.5% of voters backed Brexit. “The day after the referendum, I realised I was … guilty, in the sense of having looked in different directions,” Albarn explains. “I’ve played the big towns in England, which is what you get drawn into. But I wanted to begin to understand how this abyss had opened up in the centre of our culture. And Blackpool, maybe from the time I’d been there with Blur, just fascinated me. It was partly about memory: those pictures of everyone dressed beautifully, hanging out on the sand. And the modern Blackpool. The hedonism. The families who look after the piers and are still trying to make a go of it. The tower, which is sturdy and magnificent. You also get into the anti-fracking campaign in the countryside not that far away. It’s just a whole musical terrain.”\n\nAlbarn, Simonon and Tong spent a week there working on new material in January 2017. The album was going to focus on Blackpool, but its scope widened when Albarn began an on-off odyssey around the country, fitted in between two years of touring with Gorillaz. “I was observing,” he says. “Watching, listening. Just taking it all in, like a fine wine,” he laughs. “I went to St Albans. I went to Banbury, Oxford and Luton. Liverpool, Southend. I just walked around – had a cup of tea somewhere, or went to a pub. I wasn’t interviewing people: I was on these quiet, meditative pilgrimages to towns I’d never been to, to learn more about where I came from.”\n\nThe music they wrote suggests no end of ghosts: off-key pub pianos, bass recorders, an abundance of old-school organ that instantly evokes the British seaside. A song called Lady Boston has the most vivid sense of place, pushing the record out of England and into Wales. It was inspired by Albarn’s visit to Penrhyn castle, near Bangor, a Victorian stately home built using the inherited proceeds from slavery in Jamaica. The band returned there to record the finished song, which has a Welsh-language refrain sung by the Penrhyn male voice choir: “Dwi wrth dy gefn”, which roughly translates as, “I’ve got your back.”\n\n“It has a sense of, ‘We rely on each other’,” says Albarn. “We live on this stroppy little island, and we need to talk to each other. But have we not just spent the last couple of years going round in circles? As Danny Dyer said, it’s a mad riddle. Or you could say it’s an Anglo-Saxistentialist crisis.”\n\nWhat does he mean? “I was looking through stuff not that long ago, and I found a front page of the Sun from the Britpop era. I’d written on a bit of it in Biro when I was doing Parklife: ‘Anglo-Saxistentalism’. I thought: ‘That’s weird – that’s what I’m talking about now.’ In the most crass form, we say we want our country back. But you need to know what your country is before you want it back. And part of that is understanding who we are. We’re Vikings. We’re Anglo-Saxons. We’re French, Belgian, Nigerian, Caribbean, Ghanian, Somalian, Pakistani. To say, ‘We’re just this’ seems ridiculous to me. That’s all. That’s my biggest problem with [Brexit]: don’t limit yourself, guys. I don’t think we can afford to have that attitude. We need to be very outward-looking.”\n\nHe returns to Blackpool, or somewhere like it. “That’s why we have all those piers. That’s a kind of metaphor for trying to reach out into the world.”\n\nThe Good, the Bad & the Queen in London, 2018. Photograph: David Levene/Guardian\n\nFor Simonon, Brexit fits awkwardly with his family background, which lies variously in the Belgian city of Liège, Nice and Whitby – and lots of the popular instincts that fed into the referendum result sit at odds with the band with which he cut his teeth. In the Clash documentary Westway to the"}
